//  `<svg version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 55.333 55.333" style="enable-background:new 0 0 55.333 55.333;" xml:space="preserve"><g><path style="fill:#010002;" d="M43.5,0H11.833c-6.341,0-11.5,5.159-11.5,11.5v32.333c0,6.341,5.159,11.5,11.5,11.5H43.5 c6.341,0,11.5-5.159,11.5-11.5V11.5C55,5.159,49.84,0,43.5,0z M52,43.834c0,4.687-3.814,8.5-8.5,8.5H11.833 c-4.687,0-8.5-3.813-8.5-8.5V11.5c0-4.687,3.813-8.5,8.5-8.5H43.5c4.686,0,8.5,3.813,8.5,8.5V43.834z M13,6.167 c-3.125,0-5.667,2.542-5.667,5.667S9.875,17.501,13,17.501s5.667-2.542,5.667-5.667S16.125,6.167,13,6.167z M13,14.501 c-1.471,0-2.667-1.196-2.667-2.667S11.529,9.167,13,9.167s2.667,1.196,2.667,2.667S14.472,14.501,13,14.501z M13,22 c-3.125,0-5.667,2.542-5.667,5.667S9.875,33.334,13,33.334s5.667-2.542,5.667-5.667S16.125,22,13,22z M13,30.334 c-1.471,0-2.667-1.196-2.667-2.667S11.529,25,13,25s2.667,1.196,2.667,2.667S14.472,30.334,13,30.334z M13,37.833 c-3.125,0-5.667,2.542-5.667,5.667S9.875,49.167,13,49.167s5.667-2.542,5.667-5.667S16.125,37.833,13,37.833z M13,46.167 c-1.471,0-2.667-1.196-2.667-2.667s1.196-2.667,2.667-2.667s2.667,1.196,2.667,2.667S14.472,46.167,13,46.167z M42.167,6.667 c-3.125,0-5.667,2.542-5.667,5.667s2.542,5.667,5.667,5.667s5.667-2.542,5.667-5.667S45.292,6.667,42.167,6.667z M42.167,15.001 c-1.471,0-2.667-1.196-2.667-2.667s1.196-2.667,2.667-2.667s2.667,1.196,2.667,2.667S43.639,15.001,42.167,15.001z M42.167,22.5 c-3.125,0-5.667,2.542-5.667,5.667s2.542,5.667,5.667,5.667s5.667-2.542,5.667-5.667S45.292,22.5,42.167,22.5z M42.167,30.834 c-1.471,0-2.667-1.196-2.667-2.667s1.196-2.667,2.667-2.667s2.667,1.196,2.667,2.667S43.639,30.834,42.167,30.834z M42.167,38.334 c-3.125,0-5.667,2.542-5.667,5.667s2.542,5.666,5.667,5.666s5.667-2.542,5.667-5.667S45.292,38.334,42.167,38.334z M42.167,46.667 c-1.471,0-2.667-1.196-2.667-2.667s1.196-2.667,2.667-2.667s2.667,1.196,2.667,2.667S43.639,46.667,42.167,46.667z"/></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g></svg>`;
const libIcon = `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 512 512" style="enable-background:new 0 0 512 512;" xml:space="preserve"><g><g><path d="M210.241,269.714H27.473C12.299,269.714,0,282.013,0,297.187v182.768c0,15.174,12.299,27.473,27.473,27.473h182.768 c15.174,0,27.473-12.299,27.473-27.473V297.187C237.714,282.013,225.415,269.714,210.241,269.714z M219.429,479.955 c0,5.074-4.114,9.187-9.187,9.187H27.473c-5.074,0-9.187-4.114-9.187-9.187V297.187c0-5.074,4.114-9.187,9.187-9.187h182.768 c5.074,0,9.187,4.114,9.187,9.187V479.955z"/></g></g><g><g><path d="M484.527,269.714H301.759c-15.174,0-27.473,12.299-27.473,27.473v182.768c0,15.174,12.299,27.473,27.473,27.473h182.768 c15.174,0,27.473-12.299,27.473-27.473V297.187C512,282.013,499.701,269.714,484.527,269.714z M493.714,479.955 c0,5.074-4.114,9.187-9.187,9.187H301.759c-5.074,0-9.187-4.114-9.187-9.187V297.187c0-5.074,4.114-9.187,9.187-9.187h182.768 c5.074,0,9.187,4.114,9.187,9.187V479.955z"/></g></g><g><g><path d="M210.241,4.571H27.473C12.299,4.571,0,16.872,0,32.046v182.766c0,15.174,12.299,27.474,27.473,27.474h182.768 c15.174,0,27.473-12.3,27.473-27.474V32.046C237.714,16.872,225.415,4.571,210.241,4.571z M219.429,214.813 c0,5.074-4.114,9.187-9.187,9.187H27.473c-5.074,0-9.187-4.114-9.187-9.187V32.045c0-5.074,4.114-9.187,9.187-9.187h182.768 c5.074,0,9.187,4.114,9.187,9.187V214.813z"/></g></g><g><g><path d="M484.527,4.571H301.759c-15.174,0-27.473,12.3-27.473,27.474v182.766c0,15.174,12.299,27.474,27.473,27.474h182.768 c15.174,0,27.473-12.3,27.473-27.474V32.046C512,16.872,499.701,4.571,484.527,4.571z M493.714,214.813 c0,5.074-4.114,9.187-9.187,9.187H301.759c-5.074,0-9.187-4.114-9.187-9.187V32.045c0-5.074,4.114-9.187,9.187-9.187h182.768 c5.074,0,9.187,4.114,9.187,9.187V214.813z"/></g></g><g><g><path d="M65.143,306.286c-15.125,0-27.429,12.304-27.429,27.429c0,15.125,12.304,27.429,27.429,27.429 c15.125,0,27.429-12.304,27.429-27.429C92.571,318.589,80.268,306.286,65.143,306.286z M65.143,342.857 c-5.043,0-9.143-4.1-9.143-9.143c0-5.043,4.1-9.143,9.143-9.143c5.042,0,9.143,4.1,9.143,9.143 C74.286,338.757,70.185,342.857,65.143,342.857z"/></g></g><g><g><path d="M120,361.143c-15.125,0-27.429,12.304-27.429,27.429C92.571,403.696,104.875,416,120,416 c15.125,0,27.429-12.304,27.429-27.429C147.429,373.446,135.125,361.143,120,361.143z M120,397.714 c-5.042,0-9.143-4.1-9.143-9.143c0-5.042,4.1-9.143,9.143-9.143c5.043,0,9.143,4.1,9.143,9.143 C129.143,393.614,125.043,397.714,120,397.714z"/></g></g><g><g><path d="M394.286,96c-15.125,0-27.429,12.305-27.429,27.429c0,15.124,12.304,27.429,27.429,27.429 c15.125,0,27.429-12.305,27.429-27.429C421.714,108.305,409.411,96,394.286,96z M394.286,132.571 c-5.042,0-9.143-4.102-9.143-9.143c0-5.041,4.1-9.143,9.143-9.143c5.043,0,9.143,4.102,9.143,9.143 C403.429,128.47,399.328,132.571,394.286,132.571z"/></g></g><g><g><path d="M65.143,150.857c-15.125,0-27.429,12.305-27.429,27.429s12.304,27.429,27.429,27.429 c15.125,0,27.429-12.305,27.429-27.429S80.268,150.857,65.143,150.857z M65.143,187.429c-5.043,0-9.143-4.102-9.143-9.143 s4.1-9.143,9.143-9.143c5.042,0,9.143,4.102,9.143,9.143S70.185,187.429,65.143,187.429z"/></g></g><g><g><path d="M174.857,41.143c-15.125,0-27.429,12.305-27.429,27.429S159.732,96,174.857,96c15.125,0,27.429-12.305,27.429-27.429 S189.982,41.143,174.857,41.143z M174.857,77.714c-5.043,0-9.143-4.102-9.143-9.143s4.1-9.143,9.143-9.143 c5.042,0,9.143,4.102,9.143,9.143S179.9,77.714,174.857,77.714z"/></g></g><g><g><path d="M339.429,306.286c-15.125,0-27.429,12.304-27.429,27.429c0,15.125,12.304,27.429,27.429,27.429 s27.429-12.304,27.429-27.429C366.857,318.589,354.554,306.286,339.429,306.286z M339.429,342.857c-5.043,0-9.143-4.1-9.143-9.143 c0-5.043,4.1-9.143,9.143-9.143s9.143,4.1,9.143,9.143C348.571,338.757,344.471,342.857,339.429,342.857z"/></g></g><g><g><path d="M339.429,416C324.304,416,312,428.304,312,443.429c0,15.125,12.304,27.429,27.429,27.429s27.429-12.304,27.429-27.429 C366.857,428.304,354.554,416,339.429,416z M339.429,452.571c-5.043,0-9.143-4.1-9.143-9.143c0-5.043,4.1-9.143,9.143-9.143 s9.143,4.1,9.143,9.143C348.571,448.471,344.471,452.571,339.429,452.571z"/></g></g><g><g><path d="M449.143,306.286c-15.125,0-27.429,12.304-27.429,27.429c0,15.125,12.304,27.429,27.429,27.429 c15.125,0,27.429-12.304,27.429-27.429C476.571,318.589,464.268,306.286,449.143,306.286z M449.143,342.857 c-5.043,0-9.143-4.1-9.143-9.143c0-5.043,4.1-9.143,9.143-9.143c5.042,0,9.143,4.1,9.143,9.143 C458.286,338.757,454.185,342.857,449.143,342.857z"/></g></g><g><g><path d="M449.143,416c-15.125,0-27.429,12.304-27.429,27.429c0,15.125,12.304,27.429,27.429,27.429 c15.125,0,27.429-12.304,27.429-27.429C476.571,428.304,464.268,416,449.143,416z M449.143,452.571 c-5.043,0-9.143-4.1-9.143-9.143c0-5.043,4.1-9.143,9.143-9.143c5.042,0,9.143,4.1,9.143,9.143 C458.286,448.471,454.185,452.571,449.143,452.571z"/></g></g><g><g><path d="M174.857,416c-15.125,0-27.429,12.304-27.429,27.429c0,15.125,12.304,27.429,27.429,27.429 c15.125,0,27.429-12.304,27.429-27.429C202.286,428.304,189.982,416,174.857,416z M174.857,452.571 c-5.043,0-9.143-4.1-9.143-9.143c0-5.043,4.1-9.143,9.143-9.143c5.042,0,9.143,4.1,9.143,9.143 C184,448.471,179.9,452.571,174.857,452.571z"/></g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g><g></g></svg>`
const rollIcon = `<svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 512.004 512.004" style="enable-background:new 0 0 512.004 512.004;" xml:space="preserve"><g><g><g><path fill="#050038" d="M468.975,0.002H341.7c-23.771,0-43.029,19.258-43.029,43.029v127.275c0,23.771,19.258,43.029,43.029,43.029h127.275c23.771,0,43.029-19.258,43.029-43.029V43.031C512.004,19.26,492.746,0.002,468.975,0.002z M469.338,170.306c0,0.207-0.155,0.363-0.363,0.363H341.7c-0.207,0-0.363-0.155-0.363-0.363V43.031c0-0.207,0.155-0.363,0.363-0.363h127.275c0.207,0,0.363,0.155,0.363,0.363V170.306z"/><path fill="#050038" d="M405.333,85.335c-11.776,0-21.333,9.557-21.333,21.333s9.557,21.333,21.333,21.333s21.333-9.557,21.333-21.333S417.109,85.335,405.333,85.335z"/><path fill="#050038" d="M399.032,265.921l-54.092,54.073h-28.602c2.373-6.678,3.666-13.859,3.666-21.333c0-35.249-28.751-64-64-64H152.796L128,226.403v-34.401c0-11.782-9.551-21.333-21.333-21.333H21.333C9.551,170.669,0,180.22,0,192.002v298.667c0,11.782,9.551,21.333,21.333,21.333h85.333c11.782,0,21.333-9.551,21.333-21.333v-21.342h127.066c60.397,0,119.538-17.22,170.512-49.648l3.637-2.917l60.331-60.352c24.927-24.895,24.927-65.568-0.003-90.498C464.612,240.981,423.94,240.981,399.032,265.921z M85.333,469.336H42.667v-256h42.667V469.336z M459.382,326.232l-58.654,58.674c-43.686,27.281-94.146,41.754-145.663,41.754H128.004V271.375l14.593,4.86c2.173,0.724,4.449,1.093,6.74,1.093h106.667c11.685,0,21.333,9.649,21.333,21.333c0,11.685-9.649,21.333-21.333,21.333c-28.444,0-28.444,42.667,0,42.667h97.771c5.657,0,11.082-2.247,15.082-6.246l60.352-60.331c8.257-8.267,21.899-8.267,30.163-0.003S467.637,317.988,459.382,326.232z"/></g></g></g></svg>`;
const dices = {
  "р": ["Перо", "Крот", "Драгоценности", "Карандаш", "Сковорода", "Нора", "Кровать", "Гитара", "Инструменты", "Червяк", "Кирка", "Пальто из драпа", "Краски", "Грибы", "Кресло", "Дерево", "Веревка", "Телевизор", "Бриллиант", "Самовар", "Рамка", "Картина", "Дрова", "Топор", "Лавр", "Варенье", "Коврижка", "Божья коровка", "Шарф", "Ромашки", "Трава", "Корзина", "Кристалл", "Ковер", "Табурет", "Поаврежка", "Радуга", "Морковь", "Брокколи", "Арбуз", "Игрушка", "Дверь", "Ведро", "Красное ведро", "Озеро", "Барашек", "Королева", "Корова", "Кура", "Курица", "Забор", "Огород", "Кустарник", "Труба", "Красная шапочка", "Дорожка", "Дорога", "Тропинка", "Тропа", "Гравий", "Красные розы", "Розовые розы", "Черепица", "Картофель", "Ракушка", "Мухомор", "Ветры", "Комары", "Торт", "Бревно", "Кора", "Варево", "Динозавр", "Рыба", "Пробка"],
  "ж-ш": ["Шаг", "Шар", "Шарф", "Шайба", "Шапка", "Шахта", "Мышата", "Большая", "Ушанка", "Мешать", "Решать", "Дышать", "Лошадка", "Шахматы", "Лапша", "Шорох", "Мешок", "Пушок", "Вершок", "Горшок", "Петушок", "Ремешок", "Гребешок", "Большой", "Мышонок", "Шёл", "Шёлк", "Шёпот", "Ушёл", "Нашёл", "Пришёл", "Вошёл", "Ширь", "Шило", "Шина", "Шить", "Ширма", "Дыши", "Ерши", "Пиши", "Камыши", "Малыши", "Ушиб", "Ошибка", "Машина", "Кувшин", "Шум", "Шут", "Шуба", "Шутка", "Мишутка", "Дышу", "Ношу", "Тушу", "Шея", "Мишень", "Ошейник", "Решение", "Кошка", "Мошка", "Крошка", "Окошко", "Горошки", "Лукошко", "Ладошка", "Окрошка", "Картошка", "Душ", "Ушки", "Мушка", "Пушка", "Душно", "Опушка", "Лягушка", "Подушка", "Катушка", "Кукушка", "Квакушка", "Ватрушка", "Радушный", "Ракушка", "Вышка", "Мышка", "Пышка", "Крышка", "Малышка", "Мартышка", "Покрышка", "Камыш", "Малыш", "Бляшка", "Гуляш", "Жар", "Жаль", "Жаба", "Жало", "Жабры", "Жатва", "Жарко", "Жалоба", "Ежата", "Вожак", "Вожатый", "Пижама", "Урожай", "Бежать", "Лежать", "Дрожать", "Пожар", "Пожарник", "Жора", "Ожог", "Рожок", "Лужок", "Дружок", "Флажок", "Пирожок", "Бережок", "Крыжовник", "Жёлоб", "Жёлудь", "Жёлтый", "Жук", "Лежу", "Брожу", "Хожу", "Гляжу", "Дружу", "Покажу", "Абажур", "Тужурка", "Женя", "Уже", "Уважение", "Этажерка", "Жир", "Жить", "Жила", "Жидкий", "Ножи", "Моржи", "Ежи", "Лежи", "Пружина", "Наживка", "Покажи", "Прикажи", "Дружить", "Кружить", "Жара", "Жалеть", "Кожа", "Лужа", "Лёжа", "Вижу", "Режу", "Вяжут", "Лижут", "Мажут", "Живой", "Кожура", "Журнал", "Журавль", "Лыжи", "Ёжик", "Ужин", "Пыжик", "Рыжик", "Живот", "Жираф", "Дюжина", "Прохожий"],
}
let rollTooltipLabel = 'Бросить';
let createTooltipLabel = 'Создать кубик "р"';

console.log("HI IM HERE")
let isAuth = async () => {
  return await $.ajax({
    url: '/plugin/wordman_2/auth',
    method: 'GET',
    headers: {
      'Content-Type': 'application/json'
    },
    data: {
      access_token: await miro.getToken()
    }
  }).then(res => {
  	switch(parseInt(res.code / 100)){
  		case 2: 
  		    miro.showErrorNotification(res.message);
  		    return false;
  		case 1:     
  		    miro.showNotification(res.message);
  		    return true;
  		default: return true;
  	}
  }, () => {
    miro.showErrorNotification('Server error, please, try again later');
    return false;
  })
}
let authResponse = {code: 201, message: 'Something goes wrong, try again later'}

// gah.wait(5, 20 * 60, () => gah.event('DiceMan', 'use_often', '', 500))
miro.onReady(async () => {
  isAuth().then(res => {authResponse = res})
	miro.currentUser.getId().then(user_id =>
    gah.setUser(user_id));
  // gah.event('DiceMan', 'available', 'true', 10)
	miro.initialize({
		extensionPoints: {
			toolbar: {
        title: 'My Dice',
        toolbarSvgIcon: libIcon,
        librarySvgIcon: libIcon,
        onClick: () => {
          miro.board.ui.openLibrary('/views/wordman_2/dice_lib', {title: "Wordman"});
        }
      },
			getWidgetMenuItems: (widgets) => {
        clientId = miro.getClientId()
        let all_stikers = true;
        let all_required_dices = true;
        for(widget in widgets){
          if (
            widget.type.toLowerCase() == 'sticker' 
            && (
              !widget.meta[clientId] 
              || !widget.metadata[clientId].isCustomDice
            )
          ){
            all_required_dices = false;
          }else
            all_stikers = false;
        }

        if (all_required_dices)
          return Promise.resolve([{
						tooltip: rollTooltipLabel,
						svgIcon: rollIcon,
						onClick: rollCustomDice
          }]);
        
        if (all_stikers)
          return Promise.resolve([{
            tooltip: createTooltipLabel,
            svgIcon: createIcon,
            onClick: createCustomDice
          }]);

        return Promise.resolve([]);
			}
		}
	});
  miro.addListener('WIDGETS_TRANSFORMATION_UPDATED', result => {
    let clientId = miro.getClientId()
    let count = result.data.filter(widget => {
      return widget.metadata[clientId] && widget.metadata[clientId].isCustomDice
    }).length
    // gah.event('DiceMan', 'touch', count, 50)
  })
  Object.defineProperty(window, 'team_id', {
      value: (await miro.account.get())['id'],
      configurable: false,
      writable: false
  });
  Object.defineProperty(window, 'user_id', {
      value: await miro.currentUser.getId(),
      configurable: false,
      writable: false
  });
	$.ajax({
		url: '/user/startSession',
		method: 'POST',
		headers: {
			'Content-Type': 'application/json'
		},
		data: JSON.stringify({
			access_token: await miro.getToken()
		})
	});
});

function getRandomInt(min, max) {
  min = Math.ceil(min);
  max = Math.floor(max);
  return Math.floor(Math.random() * (max - min + 1)) + min;
};

async function rollCustomDice() {
  switch(parseInt(authResponse.code / 100)){
    case 5:
      miro.showErrorNotification(authResponse.message);
      return;
    case 2: 
      miro.showErrorNotification(authResponse.message);
      return;
    case 1:
      miro.showNotification(authResponse.message);
  }

  let widgets = await miro.board.selection.get();
  let gahSizes = [];
  widgets = await Promise.all(widgets.map( async (widget) => {
    if (widget.meta[clientId] && widget.metadata[clientId].isCustomDice){
      for (key in widget.metadata){
        if (key != clientId)
          delete widget.metadata[key];
      }
      widget.text = `<p>${words[getRandomInt(0, words.length - 1)]}<p>`;
      gahSizes.push(widget.bounds.width)
      return widget;
    }
    return null;
  }));

  widgets = widgets.filter((widget) => widget);
  if (widgets){
    miro.board.widgets.update(widgets);
    let meanSize = gahSizes.reduce((sum, cur) => sum + cur, 0) / gahSizes.length;
    gah.pin();
    // gah.event('DiceMan', 'use', meanSize, 50);
  }
};

async function createCustomDice(){
  switch(parseInt(authResponse.code / 100)){
    case 5:
      miro.showErrorNotification(authResponse.message);
      return;
    case 2: 
      miro.showErrorNotification(authResponse.message);
      return;
    case 1:
      miro.showNotification(authResponse.message);
  }

  let widgets = await miro.board.selection.get();
  let gahSizes = [];
  widgets = await Promise.all(widgets.map( async (widget) => {
    if (!widget.meta[clientId] || !widget.metadata[clientId].isCustomDice){
      for (key in widget.metadata){
        if (key != clientId)
          delete widget.metadata[key];
      }
      widget.meta[clientId] = {
        isCustomDice: true
      };
      widget.capabilities.editable = false;
      widget.text = `<p>Бросте кость с помощью кнопки в панели<p>`;
      gahSizes.push(widget.bounds.width)
      return widget;
    }
    return null;
  }));

  widgets = widgets.filter((widget) => widget);
  if (widgets){
    miro.board.widgets.update(widgets);
    let meanSize = gahSizes.reduce((sum, cur) => sum + cur, 0) / gahSizes.length;
    gah.pin();
    // gah.event('DiceMan', 'use', meanSize, 50);
  }
}

window.addEventListener("beforeunload", async function (e) {
	await $.ajax({
		url: '/user/endSession',
		method: 'POST',
		headers: {
			'Content-Type': 'application/json'
		},
		data: JSON.stringify({
			access_token: await miro.getToken()
		})
	})
});